var p = [
    "YUKI. N>","Если ты читаешь это сообщение, вероятно, я – это уже не я.",
    "YUKI. N>","Раз это сообщение возникло на экране, значит, ты, я, Судзумия Харухи, Асахина Микуру и Коидзуми Ицки все собраны в этой комнате.",
    "YUKI. N>","Это ключ.\nТы нашёл ответ.",
    "YUKI. N>","Выполняется программа экстренного выхода.\n\nЧтобы активировать её, нажми клавишу «Enter», иначе нажми любую другую клавишу.\n\nАктивировав программу, ты получишь возможность восстановить пространственно‑временной континуум. Однако, ни успех этой операции, ни твоё возвращение назад не могут быть гарантированы.",
    "YUKI. N>","Эта программа исполняется только однажды. Завершившись, она деактивирует себя.\n\nЕсли ты выберешь отказ от использования программы, она также деактивирует себя.\n",
    " ","Ready?"
]; 
var speed = 80;